Revit 2027 API
BuiltInFailures.WallFailures.CannotMaintainKeyReference Property
 Can't maintain the position of the Location Line in this Wall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotMaintainKeyReference { get; }
Public Shared ReadOnly Property CannotMaintainKeyReference As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotMaintainKeyReference {
	FailureDefinitionId^ get ();
}
static member CannotMaintainKeyReference : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace